Tekla Open API Reference for Tekla Structures 2025
LayoutAttributes Methods
The LayoutAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads drawing layout attributes from the specified attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
LayoutAttributes Class
Tekla.Structures.Drawing Namespace